src/cf/maERP_ib/src/ChartsOfCharacteristicTypes/ПоказателиРасчётаПремий/ПоказателиРасчётаПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПоказателиРасчётаПремий</name>
  <type>
    <types>Boolean</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>12</precision>
      <scale>2</scale>
    </numberQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>SMART</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АнализПродажАнализировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АнализПродажВариант</name>
    <type>
      <types>EnumRef.ВариантыАнализаПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>АнализПродажПоказатель</name>
    <type>
      <types>EnumRef.ПоказателиПродаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Веса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорогПланаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогПланаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоОтработаннымДням</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧАнализПродажПараметры</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>EnumRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧАнализПродажПодразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧАнализПродажСотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧКоэффициентыПремии</name>
    <attributes>
      <name>ВыполнениеПлана</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/cf/maERP_ib/src/ChartsOfCharacteristicTypes/ПоказателиРасчётаПремий/ManagerModule.bsl
Функция ПолучитьПроцентПремииПоВыполненномуПлану(ТЗКоэффициентыПремии, ВыполненныйПлан) Экспорт
	Если ТЗКоэффициентыПремии.Количество() = 0 Тогда
		ПроцентПремии = 100;	
	Иначе	
		ТЗКоэффициентыПремии.Сортировать("ВыполнениеПлана Убыв");
		ПроцентПремии = 0;
		Для Каждого Стр Из ТЗКоэффициентыПремии Цикл
			Если ВыполненныйПлан < Стр.ВыполнениеПлана Тогда Продолжить КонецЕсли;
			ПроцентПремии = Стр.ПроцентПремии;
			Прервать;		
		КонецЦикла;
	КонецЕсли;
	Возврат ПроцентПремии;
КонецФункции

Функция ПолучитьПоказателиПоСОтруднику(Сотрудник, НаДату = Неопределено) Экспорт
	ДатаРасчета = ?(НаДату = Неопределено, ТекущаяДатаСеанса(), НаДату);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПремииСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ПремииСотрудниковСрезПоследних.ВидПремии КАК Показатель,
	|	ЛОЖЬ КАК SMART,
	|	0 КАК План,
	|	0 КАК Факт,
	|	ПремииСотрудниковСрезПоследних.Премия КАК Стоимость,
	|	ПремииСотрудниковСрезПоследних.Премия КАК Премия
	|ИЗ
	|	РегистрСведений.ПремииСотрудников.СрезПоследних(&ДатаРасчета, Сотрудник = &Сотрудник) КАК ПремииСотрудниковСрезПоследних";
	Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
	Запрос.УстановитьПараметр("ДатаРасчета",ДатаРасчета);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
